Revit 2026 API

# FailuresAccessor Properties

---

The FailuresAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace